[
    {
        "id": 1,
        "title": "The $0 AI-Driven SOC: Building a Modern Blue Team with Wazuh",
        "excerpt": "Think you need expensive SIEM tools to run a real SOC? Think again. This article walks through how to build a practical, AI-assisted Security Operations Center using Wazuh, open-source tools, and a local LLM, proving that modern blue teams don’t need massive budgets to be effective in 2025.",
        "contentFile": "/blog-content/building-a-0-soc.html",
        "date": "Dec 18, 2025",
        "category": "Cybersecurity",
        "image": "/assets/images/id1.png",
        "thumbnail": "/assets/thumbnails/id1.png"
    },
    {
        "id": 2,
        "title": "Writing High-Fidelity YARA Rules for AI-Era Ransomware (2025)",
        "excerpt": "Hashes and static signatures don’t stand a chance against AI-generated malware anymore. In this post, I break down how modern analysts write high-fidelity YARA rules that focus on behavior, not appearances, using a real 2025 backdoor case study to show how detection still works in the age of polymorphic threats.",
        "contentFile": "/blog-content/yara.html",
        "date": "Dec 22, 2025",
        "category": "Cybersecurity",
        "image": "/assets/images/id2.png",
        "thumbnail": "/assets/thumbnails/id2.png"
    },
    {
        "id": 3,
        "title": "Smart Honeypot: Building a Modern Deception Engineering Lab",
        "excerpt": "Deception engineering is no longer just a research topic, it’s a practical defensive strategy. This article shows how to build a simple but powerful honeypot lab using Canarytokens and OpenCanary, and how these tools can help detect attackers early and respond in real time.",
        "contentFile": "/blog-content/smart_honeypot.html",
        "date": "Dec 25, 2025",
        "category": "Cybersecurity",
        "image": "/assets/images/id3.png",
        "thumbnail": "/assets/thumbnails/id3.png"
    },
    {
        "id": 4,
        "title": "Hybrid Pentesting: Why Recon Is the First Thing AI Should Touch",
        "excerpt": "AI agents are great at gathering information, but dangerous when left unchecked. In this post, I explore how pentesters use AI for reconnaissance the smart way: automating surface mapping, throttling agents to avoid WAFs, and keeping humans in control of the final attack decisions.",
        "contentFile": "/blog-content/ai-recon.html",
        "date": "Dec 27, 2025",
        "category": "Penetration Testing",
        "image": "/assets/images/id4.png",
        "thumbnail": "/assets/thumbnails/id4.png"
    },
    {
        "id": 5,
        "title": "API Penetration Testing: Hunting for “Zombie” Endpoints",
        "excerpt": "Some of the most dangerous API vulnerabilities aren’t new, they’re forgotten. This article dives into how attackers find old, unpatched “Zombie” API endpoints, test them for BOLA flaws, and why these legacy paths remain one of the most overlooked attack vectors in 2025.",
        "contentFile": "/blog-content/zombie-endpoint.html",
        "date": "Dec 31, 2025",
        "category": "Penetration Testing",
        "image": "/assets/images/id5.png",
        "thumbnail": "/assets/thumbnails/id5.png"
    },
    {
        "id": 6,
        "title": "Cloud Privilege Escalation: The “Identity” Attack Path",
        "excerpt": "In 2025, cloud breaches rarely start with a zero-day. Instead, they start with something much quieter: a misconfigured identity. In modern cloud environments, identity is the perimeter. If an attacker can abuse permissions, they don’t need malware, exploits, or infrastructure bugs.",
        "contentFile": "/blog-content/attack-path.html",
        "date": "Jan 9, 2026",
        "category": "Penetration Testing",
        "image": "/assets/images/id6.png",
        "thumbnail": "/assets/thumbnails/id6.png"
    },
    {
        "id": 7,
        "title": "Reversing Rust Malware: A Ghidra 2025 Guide",
        "excerpt": "Rust is quickly becoming the language of choice for modern malware authors in 2025 not for speed, but for how difficult it is to reverse engineer. This article breaks down why traditional analysis tools struggle with Rust binaries and how modern Ghidra plugins help analysts recover structure, behavior, and critical intelligence like command-and-control infrastructure.",
        "contentFile": "/blog-content/reverse-eng.html",
        "date": "Jan 15, 2026",
        "category": "Malware Analysis",
        "image": "/assets/images/id7.png",
        "thumbnail": "/assets/thumbnails/id7.png"
    },
    {
        "id": 8,
        "title": "Unpacking Mobile Apps: Bypassing SSL Pinning on iOS 19",
        "excerpt": "With multiple WebKit-related threats making headlines in 2025, mobile application security is back in focus. For defenders and researchers, understanding how mobile apps protect their network traffic is now a critical skill.",
        "contentFile": "/blog-content/mobile-apps.html",
        "date": "Jan 27, 2026",
        "category": "Mobile Security",
        "image": "/assets/images/id8.png",
        "thumbnail": "/assets/thumbnails/id8.png"
    }
]